{"url": "https://api.github.com/repos/taoneill/war/releases/169698", "assets_url": "https://api.github.com/repos/taoneill/war/releases/169698/assets", "upload_url": "https://uploads.github.com/repos/taoneill/war/releases/169698/assets{?name,label}", "html_url": "https://github.com/taoneill/war/releases/tag/v1.8", "id": 169698, "author": {"login": "cmastudios", "id": 1058735, "node_id": "MDQ6VXNlcjEwNTg3MzU=", "avatar_url": "https://avatars.githubusercontent.com/u/1058735?v=4", "gravatar_id": "", "url": "https://api.github.com/users/cmastudios", "html_url": "https://github.com/cmastudios", "followers_url": "https://api.github.com/users/cmastudios/followers", "following_url": "https://api.github.com/users/cmastudios/following{/other_user}", "gists_url": "https://api.github.com/users/cmastudios/gists{/gist_id}", "starred_url": "https://api.github.com/users/cmastudios/starred{/owner}{/repo}", "subscriptions_url": "https://api.github.com/users/cmastudios/subscriptions", "organizations_url": "https://api.github.com/users/cmastudios/orgs", "repos_url": "https://api.github.com/users/cmastudios/repos", "events_url": "https://api.github.com/users/cmastudios/events{/privacy}", "received_events_url": "https://api.github.com/users/cmastudios/received_events", "type": "User", "site_admin": false}, "node_id": "MDc6UmVsZWFzZTE2OTY5OA==", "tag_name": "v1.8", "target_commitish": "master", "name": "", "draft": false, "prerelease": false, "created_at": "2014-02-02T05:11:37Z", "published_at": "2014-02-02T05:32:21Z", "assets": [{"url": "https://api.github.com/repos/taoneill/war/releases/assets/69713", "id": 69713, "node_id": "MDEyOlJlbGVhc2VBc3NldDY5NzEz", "name": "War.v1.8.-.Nimitz.zip", "label": "War.v1.8.-.Nimitz.zip", "uploader": {"login": "cmastudios", "id": 1058735, "node_id": "MDQ6VXNlcjEwNTg3MzU=", "avatar_url": "https://avatars.githubusercontent.com/u/1058735?v=4", "gravatar_id": "", "url": "https://api.github.com/users/cmastudios", "html_url": "https://github.com/cmastudios", "followers_url": "https://api.github.com/users/cmastudios/followers", "following_url": "https://api.github.com/users/cmastudios/following{/other_user}", "gists_url": "https://api.github.com/users/cmastudios/gists{/gist_id}", "starred_url": "https://api.github.com/users/cmastudios/starred{/owner}{/repo}", "subscriptions_url": "https://api.github.com/users/cmastudios/subscriptions", "organizations_url": "https://api.github.com/users/cmastudios/orgs", "repos_url": "https://api.github.com/users/cmastudios/repos", "events_url": "https://api.github.com/users/cmastudios/events{/privacy}", "received_events_url": "https://api.github.com/users/cmastudios/received_events", "type": "User", "site_admin": false}, "content_type": "application/x-zip-compressed", "state": "uploaded", "size": 375952, "download_count": 59, "created_at": "2014-02-02T05:30:32Z", "updated_at": "2014-02-02T05:32:21Z", "browser_download_url": "https://github.com/taoneill/war/releases/download/v1.8/War.v1.8.-.Nimitz.zip"}], "tarball_url": "https://api.github.com/repos/taoneill/war/tarball/v1.8", "zipball_url": "https://api.github.com/repos/taoneill/war/zipball/v1.8", "body": "_God grant me the courage not to give up what I think is right even though I think it is hopeless._\n\nHello warriors,\n\nToday marks the first big release for War in more than a year: War v1.8 (Nimitz). When you get a chance, please take the time to thank the hard work and dedication of @cmastudios and our community for bringing us this long-awaited release.\n\nHere’s a rundown of all changes. Please remember to backup all your worlds and your War plugin files before applying this update.\n\n## Localization support\n\nWar has gone international! Server admins can now tailor the fun of War to their community’s culture. Please see https://github.com/taoneill/war/wiki/Languages for details.\n\nHuge thanks to the international community of translators who helped us through the webtranslateit platform!\n\n## New warzone file format for mod & future support\n\nWar now supports custom blocks for greater compatibility with other mods.\n\nWhen you first load War v1.8, your warzone files will be converted to a new SQLite-based format. This one time conversion process can take up to a few minutes when you first launch your War 1.8 server.\n\nPlease note that the new file format, while providing enhanced functionality, does take up a lot more disk space than the old format (from two to three times more space to an order of magnitude more, in the worst cases). If disk space usage is an issue for you, please let us know. Also consider taking the time to clean up your plugins/War/temp folder which stores deleted warzones and old versions.\n\nTip: if you are upgrading from War v1.7.4 or older and you want to be on the safe side, try /deletewarhub before the update. The warhub has been known to glitch randomly (destroying some blocks surrounding it, in rare occurrences) during migration to the new version. Use /setwarhub to bring back the structure after the migration.\n\n## Batched warzone resets: smoother battle endings for your server\n\nInstead of resetting all the blocks in a warzone immediately after the end of a battle, War now disables the warzone and loads the blocks in batches based on a speed property. This prevents server hangs/freezes when resetting large warzones that can sometimes cause players to get kicked due to timeouts. The new anti-crash mechanism prevents this and keeps players on, waiting anxiously for the next game to start instead of leaving.\n\nThe default speed of the resets is pretty slow, especially on new high-powered game servers. This can be changed by using /warcfg resetspeed:5000, where 5000 is the amount of blocks to reset per-tick. We personally recommend pushing this value up as high as possible as long as it doesn’t cause player disconnections.\n\nAlso, a new option allows you to completely prevent warzone resets at the end of a game: just use /zonecfg resetblocks:false. Beware of changes to the warzone caused by nature, however. See /warcfg print and /zonecfg print for more reset options.\n\n## Scoreboard\n\nThe Minecraft scoreboard can be used to display the scores of each team in a warzone or their lifepool. Use /zonecfg scoreboard:points to show scores, use /zonecfg scoreboard:lifepool to display how many lives each team has remaining and use the default “none” option to hide the scoreboard. Make sure to use /resetzone after you make this change.\n\nWant to view a warzone scoreboard while away from a game? Use /zone ziggy scoreboard to show you the scoreboard for the game in zone ziggy.\n\nPlease note more functionality will be added to the scoreboard in the next few releases. Stay tuned for updates!\n\n## Kill streaks: experimental and explosive!\n\nKillstreak rewards can be configured in the set.war.killstreak section of war.yml. Rewards will only be applied to players if the team/warzone has KILLSTREAK set to true.\n\nThe configuration section will get populated on generation of war.yml. To get this to populate after updating from war 1.7, change any /warcfg setting.\n\nCurrently the system supports messaging the entire warzone and just the attacker. The system supports rewards of items, health, airstrikes, points, and xp currently. We plan to add more in the future with your suggestions.\n\nFor an in-depth example of killstreaks in war, visit https://gist.github.com/cmastudios/5687654. Be warned the items section may be a bit hard to configure by hand; we plan to add easier ways to add to it in the future.\n\n## Signs to teleport to zones\n\nSign posts can be used as quick teleports to any warzone. Players can just walk over the signs to warp to the warzone of their choice. This is useful to create groupings or categories of warzones. See https://github.com/taoneill/war/wiki/Signs-Teleport for details.\n\n## MCStats Metrics\n\nWar now contains server stat-tracking to give the developers some insight on how servers use the plugin. This allows us to track plugin usage and gather information about which features server owners enjoy the most. Keeping this option turned on will enable us to focus our time and energy working on what the admin community desires the most.\n\nFor more information and how to disable metrics, visit https://github.com/taoneill/war/wiki/Metrics. View War plugin metrics at http://mcstats.org/plugin/War. Stats may be inaccurate until enough people update the plugin to v1.8.\n\n## Other Improvements\n- The setting blockheads:true now give your teams a colored leather helmet (instead of replacing the entire head with a colored wool block). You can still open your inventory and click your helmet armor slot to collect a wool block to help you capture monuments, though.\n- Soup PVP support thanks to @nicholasntp: turn on using /zonecfg souphealing:true\n\n## Various Fixes\n- Errors in the loadout system were causing loadouts to appear in the wrong warzones.\n- The chat box does not disappear anymore when you die and respawn (so you don’t lose the text you were typing, which used to be a major annoyance)\n- No more automatic flag or cake capture when you get automatically teleported to your team’s spawn (when you illegally exit the warzone, for example)\n- Removed the annoying “Can’t re-enter spawn” behavior. Players lose their spawn protection as soon as they walk out of their team’s spawn.\n\nThanks again for sticking with the War plugin through the years. We hope this release brings you many hours of PVP pleasure and that you forward us your feedback (suggestions and bug reports) on our Github issues board here: https://github.com/taoneill/war/issues.\n\nWar on!\n- tommytony\n"}
